disruptivepatternmaterial/trigger4/atoms3-firmware/sdkconfig.defaults.m5atoms3
# M5 AtomS3 — ESP32-S3FN8 (8MB Flash, NO PSRAM).
# Mirrors the DJI-remote AtomS3 sdkconfig so build behavior is consistent.
CONFIG_IDF_TARGET="esp32s3"

# Bluetooth — BLE 4.2 + GATT client for the TRIGGER protocol.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_GATTS_ENABLE=n
CONFIG_BT_GATTC_ENABLE=y
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_GATT_MAX_SR_PROFILES=1

# Flash 8MB (QIO)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# No PSRAM.
CONFIG_SPIRAM=n

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS — same headroom as the sibling AtomS3 build.
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_BT_BTC_TASK_STACK_SIZE=4096

CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# BLE-only — keep Wi-Fi off so the radio isn't shared.
CONFIG_ESP_WIFI_ENABLED=n

# USB-only powered; no power-management hooks needed.
CONFIG_PM_ENABLE=n
